In [ ]:
#Câu 4 A
import pandas as pd
data = pd.read_csv("drive/MyDrive/mobile_data.csv", delimiter=",", skiprows =0)

print(data.head(5))
print(data.tail(5))

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]
    index     company body-style  ...  horsepower  average-mileage    price
56     81  volkswagen      sedan  ...          85               27   7975.0
57     82  volkswagen      sedan  ...          52               37   7995.0
58     86  volkswagen      sedan  ...         100               26   9995.0
59     87       volvo      sedan  ...         114               23  12940.0
60     88       volvo      wagon  ...         114               23  13415.0

[5 rows x 10 columns]

In [ ]:
#Câu 4 D
print(data['company'].value_counts())
#print(data['company'].value_counts().plot(kind='bar'))

toyota           7
bmw              6
nissan           5
mazda            5
audi             4
volkswagen       4
mercedes-benz    4
mitsubishi       4
alfa-romero      3
jaguar           3
isuzu            3
honda            3
porsche          3
chevrolet        3
volvo            2
dodge            2
Name: company, dtype: int64

In [ ]:
#Câu 4 B
data = pd.read_csv("drive/MyDrive/mobile_data.csv", delimiter=",", skiprows =0)
data = pd.read_csv("drive/MyDrive/mobile_data.csv", delimiter=",", skiprows =0 ,na_values={
'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]})
data.head(5)

   index      company   body-style  ...  horsepower  average-mileage    price
0      0  alfa-romero  convertible  ...         111               21  13495.0
1      1  alfa-romero  convertible  ...         111               21  16500.0
2      2  alfa-romero    hatchback  ...         154               19  16500.0
3      3         audi        sedan  ...         102               24  13950.0
4      4         audi        sedan  ...         115               18  17450.0

[5 rows x 10 columns]

In [ ]:
#Câu 4 C

a = data[data['price'] == data['price'].max()]
a['company']

35    mercedes-benz
Name: company, dtype: object

In [ ]:
#Câu 4 E
data = data.sort_values('price', ascending=True)
data

    index        company body-style  ...  horsepower  average-mileage    price
13     16      chevrolet  hatchback  ...          48               47   5151.0
27     36          mazda  hatchback  ...          68               30   5195.0
48     66         toyota  hatchback  ...          62               35   5348.0
36     49     mitsubishi  hatchback  ...          68               37   5389.0
28     37          mazda  hatchback  ...          68               31   6095.0
..    ...            ...        ...  ...         ...              ...      ...
11     14            bmw      sedan  ...         182               16  41315.0
35     47  mercedes-benz    hardtop  ...         184               14  45400.0
22     31          isuzu      sedan  ...          70               38      NaN
23     32          isuzu      sedan  ...          70               38      NaN
47     63        porsche  hatchback  ...         288               17      NaN

[61 rows x 10 columns]

In [ ]:
# Câu 1 Viết hàm lấy List từ ListA bỏ đi giá trị 10
ListA = [1, 10, 20, 5, 60, 30, 10, 9, 10]
ListB = []
for x in ListA:
    if x == 10:
        continue
    ListB.append(x)
print(ListB)

[1, 20, 5, 60, 30, 9]

In [ ]:
# Câu 2  Chuyển List1, List2 sang Dictionary
List1 = ['A', 'B', 'C', 'D', 'E', 'F']
List2 = [1, 2 ,3 ,4 ,5 ,6 ]
Dict1 = {}

i = 0
while i < len(List1): 
    #Dict1[List1[i]] = List2[i]
    Dict1.update({List1[i]: List2[i]})
    i+=1

print(Dict1)

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6}

In [ ]:
# Câu 3 Xóa các key trong Key remove ra khỏi persion
person = {
    'name': 'Quoc Nam',
    'age':'28',
    'salary': '8000',
    'city': 'Tuy Hoa'
}
KeyToRemove = ['salary', 'city']
def DeleKeyOfDict(person , KeyToRemove):
    # i = 0
    # while i < len(KeyToRemove):
    #     if KeyToRemove[i] in person:
    #         del person[KeyToRemove[i]]
    #     i += 1
    # print(person)
    for x in KeyToRemove:
        if x in person:
            del person[x]
    print(person)
DeleKeyOfDict(person, KeyToRemove)

{'name': 'Quoc Nam', 'age': '28'}